Revit 2027 API
MEPNetworkSegmentData.RelativeRoughness Property
 The relative roughness of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RelativeRoughness { get; }
Public ReadOnly Property RelativeRoughness As Double
	Get
public:
property double RelativeRoughness {
	double get ();
}
member RelativeRoughness : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace